InterIsoFoamSimulation/oilWaterParticles/constant/g
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}

// Standard convention: +y up, gravity down (-y). Same as InterFoamSimulation's case.
dimensions      [0 1 -2 0 0 0 0];
value           (0 -9.81 0);
