InterIsoFoamSimulation/oilWaterParticles/constant/kinematicCloud/kinematicCloudPositions
(
    (0.20 0.50 0.005)
    (0.25 0.55 0.005)
    (0.30 0.60 0.005)
    (0.40 0.50 0.005)
    (0.50 0.50 0.005)
)
