InterIsoFoamSimulation/oilWaterParticles/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Identical fluid properties to InterFoamSimulation's case, for a like-for-like comparison.
phases (water oil);

water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6;   // = 1 cSt
    rho             [1 -3 0 0 0 0 0] 1000;
}

oil
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 5e-5;   // = 50 cSt -> mu = 0.0425 Pa.s
    rho             [1 -3 0 0 0 0 0] 850;
}

sigma           [1 0 -2 0 0 0 0] 0.03;
