InterIsoFoamSimulation/oilWaterParticles/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)              Gauss linearUpwind grad(U);
    // NOTE: div(phi,alpha)/div(phirb,alpha) below are MULES/interface-compression
    // schemes carried over from the InterFoamSimulation fvSchemes template.
    // interisofoamSolver's alphaEqn.H advects alpha1 geometrically via
    // isoAdvector (advector.advect()) and does not consult these entries —
    // they appear to be unused leftovers, kept here unchanged (comment-only pass).
    div(phi,alpha)             Gauss vanLeer;
    div(phirb,alpha)           Gauss interfaceCompression;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    alpha.water;    // still declared even though isoAdvector builds rhoPhi itself via getRhoPhi()
}
